# Delete duplicated dataframes

In [1]:
import pandas as pd
import numpy as np
import pickle

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [2]:
pickle_in=open('hedge_dfs_subset.pickle','rb')
output_dct=pickle.load(pickle_in)

In [3]:
output_dct.keys()

dict_keys(['FST20030321', 'FST20040315', 'FST20050315', 'FST20060316', 'FST20070228', 'FST20080228', 'FST20090302', 'FST20100301', 'FST20110224', 'FST20120222', 'FST20130222', 'FST20140226', 'GDP20030327', 'GDP20040412', 'GDP20060315', 'GDP20070314', 'GDP20080313', 'GDP20090227', 'GDP20100226', 'GDP20110222', 'GDP20120224', 'GDP20130222', 'GDP20140221', 'GDP20150302', 'ISRL20030331', 'ISRL20040330', 'ISRL20050331', 'ISRL20060324', 'ISRL20070316', 'ISRL20090323', 'ISRL20100312', 'ISRL20110311', 'ISRL20130315', 'ISRL20140317', 'ISRL20150310', 'ISRL20160314', 'ISRL20170314', 'MRO20030310', 'MRO20040309', 'MRO20050310', 'MRO20060306', 'MRO20070301', 'MRO20080229', 'MRO20090227', 'MRO20100226', 'MRO20110228', 'MRO20120229', 'MRO20130222', 'MRO20140228', 'MRO20150302', 'MRO20160225', 'MRO20170224', 'PLLL20050316', 'PLLL20060316', 'PLLL20070228', 'PLLL20080220', 'PLLL20090223', 'XCO20060331', 'XCO20070319', 'XCO20080229', 'XCO20090226', 'XCO20100224', 'XCO20110224', 'XCO20120227', 'XCO20130221', 'XCO20140226', 'XCO20150225', 'XCO20160302', 'XCO20170316'])

In [4]:
from zlu_functions import del_subset_col, set_col_headers, row_header_to_col
from helper import trimDictonary

In [5]:
another_dct = trimDictonary(output_dct, [])

In [6]:
for k in another_dct.keys():
    for i in range(len(another_dct[k])):
        df=another_dct[k][i]
        df=set_col_headers(df)
        df=del_subset_col(df)
        another_dct[k][i]=df

In [7]:
subdict = {k: v for k, v in another_dct.items() if k.startswith('ISRL')}

In [8]:
subdict.keys()

dict_keys(['ISRL20090323', 'ISRL20100312', 'ISRL20110311'])

In [9]:
len(subdict['ISRL20090323'])
len(subdict['ISRL20100312'])
len(subdict['ISRL20110311'])

2

6

8

In [10]:
subdict['ISRL20090323'][0]
subdict['ISRL20090323'][1]

,",","Swap Contracts.1Natural Gas,Volume (MMBTU) ( )","Swap Contracts.5Natural Gas,Weighted Average Price ($/MMBTU)","Swap Contracts.9Crude Oil,Volume (Bbl)","Swap Contracts.13Crude Oil,Weighted Average Price ($/Bbl)"
2,2009.0,2054928,8.25,274596,81.00
3,2010.0,1785648,7.88,254868,79.59
4,2011.0,764820,8.22,210307,87.53
5,2012.0,174222,8.65,31953,88.20

,",","Swap Contracts.1Natural Gas,Volume (MMBTU) ( )","Swap Contracts.5Natural Gas,Weighted Average Price ($/MMBTU)","Swap Contracts.9Crude Oil,Volume (Bbl)","Swap Contracts.13Crude Oil,Weighted Average Price ($/Bbl)"
2,2009.0,2054928,8.25,274596,81.00
3,2010.0,1785648,7.88,254868,79.59
4,2011.0,764820,8.22,210307,87.53
5,2012.0,174222,8.65,31953,88.20

In [11]:
# three set of duplicated dataframe
subdict['ISRL20100312'][0]
subdict['ISRL20100312'][3]

,",","Swap Contracts.1Natural Gas,Volume (MMBTU) ( )","Swap Contracts.5Natural Gas,Weighted Average Price ($/MMBTU)","Swap Contracts.9Crude Oil,Volume (Bbl)","Swap Contracts.13Crude Oil,Weighted Average Price ($/Bbl)"
2,2010.0,1785648,7.88,254868,79.59
3,2011.0,764820,8.22,240336,86.55
4,2012.0,174222,8.65,127473,82.37
5,2013.0,-,-,89400,85.15
6,2014.0,-,-,66000,86.95

,",","Swap Contracts.1Natural Gas,Volume (MMBTU) ( )","Swap Contracts.5Natural Gas,Weighted Average Price ($/MMBTU)","Swap Contracts.9Crude Oil,Volume (Bbl)","Swap Contracts.13Crude Oil,Weighted Average Price ($/Bbl)"
2,2010.0,1785648,7.88,254868,79.59
3,2011.0,764820,8.22,240336,86.55
4,2012.0,174222,8.65,127473,82.37
5,2013.0,-,-,89400,85.15
6,2014.0,-,-,66000,86.95

In [12]:
# four sets of duplicated dataframe
subdict['ISRL20110311'][0]
subdict['ISRL20110311'][4]

,",","Swap Contracts.1Natural Gas,Volume (MMBTU) ( )","Swap Contracts.5Natural Gas,Weighted Average Price ($/MMBTU)","Swap Contracts.9Crude Oil,Volume (Bbl)","Swap Contracts.13Crude Oil,Weighted Average Price ($/Bbl)"
2,2011.0,764820,8.22,240336,86.55
3,2012.0,174222,8.65,127473,82.37
4,2013.0,-,-,89400,85.15
5,2014.0,-,-,66000,86.95

,",","Swap Contracts.1Natural Gas,Volume (MMBTU) ( )","Swap Contracts.5Natural Gas,Weighted Average Price ($/MMBTU)","Swap Contracts.9Crude Oil,Volume (Bbl)","Swap Contracts.13Crude Oil,Weighted Average Price ($/Bbl)"
2,2011.0,764820,8.22,240336,86.55
3,2012.0,174222,8.65,127473,82.37
4,2013.0,-,-,89400,85.15
5,2014.0,-,-,66000,86.95

In [13]:
len(subdict['ISRL20090323'])
len(subdict['ISRL20100312'])
len(subdict['ISRL20110311'])

2

6

8

In [14]:
def delete_duplicated(subdict):
    '''
    subdict: dictionary with file_header as keys and list of dataframes as values
    This function removes any duplicated dataframe within the same key
    '''
    from itertools import combinations
    from collections import defaultdict
    import pandas as pd
    deleted_df = defaultdict(list) # Initialize a dictionary with list as values to house the indices
    for k in subdict.keys():
        target_list = subdict[k]
        combo_list = list(combinations(range(len(target_list)),2)) # Extract distinct combinations of indices
        duplicated_index = []
        for df1_index, df2_index in combo_list:
            if isinstance(target_list[df1_index], pd.DataFrame) & isinstance(target_list[df2_index], pd.DataFrame): # Assert that we are comparing two dataframes
                if target_list[df1_index].equals(target_list[df2_index]): # Checks if two dataframes are equal
                    duplicated_index.append(df2_index)
        to_be_del = list(set(duplicated_index)) # Remove duplicated indices in case there are >2 identical dataframes
        to_be_del.sort(reverse=True) # We want to remove the dataframes backward to not mess up with the indices
        for index in to_be_del:
            del target_list[index]
            deleted_df[k].append(index) # Save the deleted dataframe as dictionary with file_header as keys and list of respective indices as values
    return deleted_df

In [15]:
delete_duplicated(subdict)

defaultdict(list,
            {'ISRL20090323': [1],
             'ISRL20100312': [5, 4, 3],
             'ISRL20110311': [7, 6, 5, 4]})

In [16]:
len(subdict['ISRL20090323'])
len(subdict['ISRL20100312'])
len(subdict['ISRL20110311'])

1

3

4

# Delete subset dataframes

In [17]:
subdict['ISRL20100312'][0]
subdict['ISRL20100312'][1]
subdict['ISRL20100312'][2]

,",","Swap Contracts.1Natural Gas,Volume (MMBTU) ( )","Swap Contracts.5Natural Gas,Weighted Average Price ($/MMBTU)","Swap Contracts.9Crude Oil,Volume (Bbl)","Swap Contracts.13Crude Oil,Weighted Average Price ($/Bbl)"
2,2010.0,1785648,7.88,254868,79.59
3,2011.0,764820,8.22,240336,86.55
4,2012.0,174222,8.65,127473,82.37
5,2013.0,-,-,89400,85.15
6,2014.0,-,-,66000,86.95

,Period,Swaps.1Volume in MMbtu s,Swaps.5Price / Price Range,Swaps.9Weighted Average Price
1,January 2010 December 2010,1785648,$7.49|8.32,$7.88
2,January 2011 December 2011,764820,8.22,8.22
3,January 2012 March 2012,174222,8.65,8.65

,Period,Swaps.1Volume in Bbls,Swaps.5Price / Price Range,Swaps.9Weighted Average Price
1,January 2010 December 2010,254868,63.30|101.70,79.59
2,January 2011 December 2011,240336,79.50|91.05,86.55
3,January 2012 December 2012,127473,80.20|88.20,82.37
4,January 2013 December 2013,89400,85.15,85.15
5,January 2014 December 2014,66000,86.95,86.95

In [18]:
subdict['ISRL20110311'][0]
subdict['ISRL20110311'][1]
subdict['ISRL20110311'][2]

,",","Swap Contracts.1Natural Gas,Volume (MMBTU) ( )","Swap Contracts.5Natural Gas,Weighted Average Price ($/MMBTU)","Swap Contracts.9Crude Oil,Volume (Bbl)","Swap Contracts.13Crude Oil,Weighted Average Price ($/Bbl)"
2,2011.0,764820,8.22,240336,86.55
3,2012.0,174222,8.65,127473,82.37
4,2013.0,-,-,89400,85.15
5,2014.0,-,-,66000,86.95

,Period,Swaps.1Volume in MMbtu s,Swaps.5Price / Price Range,Swaps.9Weighted Average Price
1,January 2011 December 2011,764820,8.22,8.22
2,January 2012 March 2012,174222,8.65,8.65

,Period,Swaps.1Volume in Bbls,Swaps.5Price / Price Range,Swaps.9Weighted Average Price
1,January 2011 December 2011,240336,79.50|91.05,86.55
2,January 2012 December 2012,127473,80.20|88.20,82.37
3,January 2013 December 2013,89400,85.15,85.15
4,January 2014 December 2014,66000,86.95,86.95

In [19]:
def extract_subset_tables(dictionary):
    """
    This function extracts subset dataframes (both column-wise and row_wise),
    and append those into a list.
    
    dictionary: dictionary with file_header as keys and list of dataframes as values
    """
    import re
    from itertools import chain, permutations
    company_list = [] 
    subset_df_list = [] # To store the subset dataframes
    for keys in dictionary.keys():
        company_list.append(keys)
    trim_company_set = {re.sub('[0-9]', '', company) for company in company_list} # Extract unique company tickers
    for company in trim_company_set:
        subdict = {k: v for k, v in dictionary.items() if k.startswith(company)} # Dictionary comprehension for each ticker
        tables_within_a_company = list(chain.from_iterable(subdict.values())) # Flatten list of list
        combo_list = list(permutations(range(len(tables_within_a_company)),2)) # Use permutations here because sequence is important to compare subsets
        subset_index = []
        for df1_index, df2_index in combo_list:
            if isinstance(tables_within_a_company[df1_index], pd.DataFrame) & isinstance(tables_within_a_company[df1_index], pd.DataFrame):
                df1_set = {x for x in (tables_within_a_company[df1_index].to_numpy().flatten()) if pd.notna(x) & (x != '')}
                df2_set = {x for x in (tables_within_a_company[df2_index].to_numpy().flatten()) if pd.notna(x) & (x != '')} # Flatten a dataframe to get unique cell values (Might leads to data loss, but unlikely)
                if df1_set.issubset(df2_set):
                    subset_index.append(df1_index)
        to_be_del = list(set(subset_index))
        for index in to_be_del:
            subset_df_list.append(tables_within_a_company[index])
    return subset_df_list

In [20]:
def remove_subset_tables(dictionary, list_subset_tables):
    '''
    This function removes dataframes that are subset of other dataframes within the same ticker,
    outputs a dictionary indicating deleted tickers and respective indices.
    '''
    from collections import defaultdict
    deleted_df = defaultdict(list) # Initialize a dictionary with list as values to house the indices
    for k in dictionary.keys():
        target_list = dictionary[k]
        duplicated_index = []
        for index in range(len(target_list)):
            for subset_df in list_subset_tables:
                if isinstance(target_list[index], pd.DataFrame):
                    if target_list[index].equals(subset_df): # Compare if the dataframes matches the subset dataframes
                        duplicated_index.append(index)              
        to_be_del = list(set(duplicated_index)) # Remove duplicated indices in case there are >2 identical dataframes
        to_be_del.sort(reverse=True) # We want to remove the dataframes backward to not mess up with the indices
        for index in to_be_del:
            del target_list[index]
            deleted_df[k].append(index) # Save the deleted dataframes as dictionary with file_header as keys and list of respective indices as values
    return deleted_df

In [21]:
remove_subset_tables(subdict, extract_subset_tables(subdict))

defaultdict(list, {'ISRL20110311': [2, 1, 0]})